Repository: Jauwa0/prestashop-module-promotionnalbanner
Catalog: translations/*/ModulesPromotionalbannerAdmin.*.xlf
Languages: fr_fr

source: Background image
fr_fr: Image d'arrière-plan

source: Background image of the banner.
fr_fr: Image d'arrière-plan de la bannière.

source: Banner updated.
fr_fr: Bannière mise à jour.

source: Choose a background image for your banner. Allowed formats are: %imgBgExtAllowedLabel%. (max. 500 ko, ideal ratio 3:1).
fr_fr: Choisissez une image d'arrière-plan pour votre bannière. Les formats autorisés sont : %imgBgExtAllowedLabel% (500 Ko max., ratio idéal : 3:1).

source: Choose a file
fr_fr: Choisir un fichier

source: DB error while cleaning configuration.
fr_fr: Erreur dans la base de données lors du nettoyage de la configuration.

source: DB error while initialising default configuration.
fr_fr: Erreur dans la base de données lors de l'initialisation de la configuration par défaut.

source: Define the text/paragraph below your title (max 150 char).
fr_fr: Définissez le texte/paragraphe sous votre titre (max 150 caractères).

source: Displays a promotional banner on the website's homepage. Configuration: Title, test, image, and display duration.
fr_fr: Affiche une bannière promotionnelle sur la page d'accueil du site web. Configuration : titre, test, image et durée d'affichage.

source: Image saving failed.
fr_fr: L'enregistrement de l'image a échoué.

source: It seems that a problem in your store is preventing the module from being installed.
fr_fr: Un problème dans votre boutique empêche l'installation du module.

source: It seems that an issue in the Hooks registry is preventing the module from working properly.
fr_fr: Un problème dans le registre Hooks empêche le module de fonctionner correctement.

source: It seems that there is an issue in your store that is preventing the module from being uninstalled.
fr_fr: Il semble qu'il y ait un problème dans votre boutique qui empêche la désinstallation du module.

source: Promotional Banner
fr_fr: Bannière promotionnelle

source: Promotional Banner Settings
fr_fr: Paramètres de bannière promotionnelle

source: Save
fr_fr: Sauvegarder

source: Set the title of your promotional banner (max 150 char).
fr_fr: Définissez le titre de votre bannière promotionnelle (max 150 caractères).

source: Title
fr_fr: Titre
